# Chapter 5 練習と総合問題解答

## 5.2 SQLの基礎

### 5.2.1 データベースとテーブルの作成

#### <練習問題 1>

セルを追加（左上にある＋を押下）して、今あるデータベースを表示させましょう。そして、新しいデータベース（TEST2など）を作って、そのデータベースを使うように選択しましょう。

In [1]:
/*解答*/
show databases;

/*解答*/ show databases;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| TEST1              |
| employees          |
| foodmart_mondrian  |
| mysql              |
| performance_schema |
| sakila             |
| sys                |
| test2              |
| world              |
+--------------------+
10 rows in set (0.00 sec)

In [2]:
/*解答*/
create database test2;
use test2;

/*解答*/ create database test2; use test2;

ERROR 1007 (HY000): Can't create database 'test2'; database exists
Database changed

#### <練習問題 2>

練習問題１で作成、選択したデータベースに新しいテーブル「meibo2」を作成してください。作成後はテーブルが完成しているか、確認しましょう。

In [3]:
/*解答*/
create table meibo2
  (id int primary key, name varchar(20))
  engine = MyISAM
  default charset = utf8;

/*解答*/ create table meibo2 (id int primary key, name varchar(20)) engine = MyISAM default charset = utf8;

ERROR 1050 (42S01): Table 'meibo2' already exists


In [4]:
/*解答*/
show tables;

/*解答*/ show tables;
+-----------------+
| Tables_in_test2 |
+-----------------+
| meibo2          |
+-----------------+
1 row in set (0.00 sec)

#### <練習問題 3>

新しく作ったテーブルにデータを追加してみましょう。追加後は、確かにデータが入っているか確認してください。

In [5]:
/*解答*/
insert into meibo2 (id, name) values (1, "Saito");
insert into meibo2 (id, name) values (2, "Murakami");
insert into meibo2 (id, name) values (3, "Inoue");

/*解答*/ insert into meibo2 (id, name) values (1, "Saito"); insert into meibo2 (id, name) values (2, "Murakami"); insert into meibo2 (id, name) values (3, "Inoue");

ERROR 1062 (23000): Duplicate entry '1' for key 'PRIMARY'
ERROR 1062 (23000): Duplicate entry '2' for key 'PRIMARY'
ERROR 1062 (23000): Duplicate entry '3' for key 'PRIMARY'


In [6]:
/*解答*/
select * from meibo2;

/*解答*/ select * from meibo2;
+----+----------+
| id | name     |
+----+----------+
|  1 | Saito    |
|  2 | Murakami |
|  3 | Inoue    |
+----+----------+
3 rows in set (0.01 sec)

### 5.2.2 データの検索と更新、テーブルカラムの変更

#### <練習問題 1>

TEST1のデータベースを選択して、上記のテーブルmeiboにて、id=4の人レコードを抽出してください。

In [7]:
/*解答*/
use TEST1;

/*解答*/ use TEST1;

Database changed

In [8]:
/*解答*/
select * from meibo where id=4;

/*解答*/ select * from meibo where id=4;
+----+------+-------+------+
| id | name | class | age  |
+----+------+-------+------+
|  4 | Kato |     2 |   15 |
+----+------+-------+------+
1 row in set (0.01 sec)

#### <練習問題 2>

上のmeiboテーブルでid=8の人のclassを7にアップデートしてください。

In [9]:
/*解答*/
update meibo
 set class = 7
 where id=8;

/*解答*/ update meibo set class = 7 where id=8;

Query OK, 1 row affected (0.00 sec)
Rows matched: 1  Changed: 1  Warnings: 0

In [10]:
/*解答*/
select * from meibo;

/*解答*/ select * from meibo;
+-----+--------------+-------+------+
| id  | name         | class | age  |
+-----+--------------+-------+------+
|   1 | Yamada       |     1 |   14 |
|   2 | Tanaka       |     2 |   13 |
|   3 | Suzuki       |     1 |   13 |
|   4 | Kato         |     2 |   15 |
|   5 | Ito          |     3 |   12 |
|   6 | Takeuchi     |     2 |   16 |
|   7 | Kimura       |     3 |   11 |
|   8 | Sato         |     7 |   14 |
| 100 | dummy_Yamada |  NULL | NULL |
| 200 | dummy_Tanaka |  NULL | NULL |
| 300 | dummy_Sato   |  NULL | NULL |
+-----+--------------+-------+------+
11 rows in set (0.00 sec)

#### <練習問題 3>

上記と同じテーブルmeiboに新しい列highという身長を追加してください。さらに、id=1から4までの人は150、id=5から6までの人は155、id=7から8までの人は160でアップデートしてください。

In [11]:
/*解答*/
alter table meibo add high int;

/*解答*/ alter table meibo add high int;

Query OK, 11 rows affected (0.01 sec)
Records: 11  Duplicates: 0  Warnings: 0

In [12]:
/*解答*/
select * from meibo;

/*解答*/ select * from meibo;
+-----+--------------+-------+------+------+
| id  | name         | class | age  | high |
+-----+--------------+-------+------+------+
|   1 | Yamada       |     1 |   14 | NULL |
|   2 | Tanaka       |     2 |   13 | NULL |
|   3 | Suzuki       |     1 |   13 | NULL |
|   4 | Kato         |     2 |   15 | NULL |
|   5 | Ito          |     3 |   12 | NULL |
|   6 | Takeuchi     |     2 |   16 | NULL |
|   7 | Kimura       |     3 |   11 | NULL |
|   8 | Sato         |     7 |   14 | NULL |
| 100 | dummy_Yamada |  NULL | NULL | NULL |
| 200 | dummy_Tanaka |  NULL | NULL | NULL |
| 300 | dummy_Sato   |  NULL | NULL | NULL |
+-----+--------------+-------+------+------+
11 rows in set (0.00 sec)

In [13]:
/*解答*/
update meibo
 set high=150
 where id<=4;

update meibo
 set high=155
 where id>=5 and id<=6;
 
update meibo
 set high=160
 where id>=7;

/*解答*/ update meibo set high=150 where id<=4; update meibo set high=155 where id>=5 and id<=6; update meibo set high=160 where id>=7;

Query OK, 4 rows affected (0.00 sec)
Rows matched: 4  Changed: 4  Warnings: 0

Query OK, 2 rows affected (0.00 sec)
Rows matched: 2  Changed: 2  Warnings: 0

Query OK, 5 rows affected (0.00 sec)
Rows matched: 5  Changed: 5  Warnings: 0

In [14]:
/*解答*/
select * from meibo;

/*解答*/ select * from meibo;
+-----+--------------+-------+------+------+
| id  | name         | class | age  | high |
+-----+--------------+-------+------+------+
|   1 | Yamada       |     1 |   14 |  150 |
|   2 | Tanaka       |     2 |   13 |  150 |
|   3 | Suzuki       |     1 |   13 |  150 |
|   4 | Kato         |     2 |   15 |  150 |
|   5 | Ito          |     3 |   12 |  155 |
|   6 | Takeuchi     |     2 |   16 |  155 |
|   7 | Kimura       |     3 |   11 |  160 |
|   8 | Sato         |     7 |   14 |  160 |
| 100 | dummy_Yamada |  NULL | NULL |  160 |
| 200 | dummy_Tanaka |  NULL | NULL |  160 |
| 300 | dummy_Sato   |  NULL | NULL |  160 |
+-----+--------------+-------+------+------+
11 rows in set (0.00 sec)

### 5.2.3 データの集計、演算、並び替え

#### <練習問題 1>
上記と同じmeiboテーブルで、異なる年齢は何種類でしょうか。

In [15]:
/* 解答 */
select count(distinct age) as ageCnt from meibo;

/* 解答 */ select count(distinct age) as ageCnt from meibo;
+--------+
| ageCnt |
+--------+
|      6 |
+--------+
1 row in set (0.00 sec)

#### <練習問題 2>
身長が一番小さい人、大きい人の身長をそれぞれ求めてください。

In [16]:
select min(high) as minhigh, max(high) as maxhigh from meibo;

select min(high) as minhigh, max(high) as maxhigh from meibo;
+---------+---------+
| minhigh | maxhigh |
+---------+---------+
|     150 |     160 |
+---------+---------+
1 row in set (0.01 sec)

#### <練習問題 3>
身長が155以上で、classが3のレコードを抽出してください。

In [17]:
select * from meibo where high>=155 and class=3;

select * from meibo where high>=155 and class=3;
+----+--------+-------+------+------+
| id | name   | class | age  | high |
+----+--------+-------+------+------+
|  5 | Ito    |     3 |   12 |  155 |
|  7 | Kimura |     3 |   11 |  160 |
+----+--------+-------+------+------+
2 rows in set (0.00 sec)

### 5.2.4 グループごとの集計

#### <練習問題 1>

meiboテーブルにて、クラスごとの平均身長を求めてみましょう。

In [18]:
/* 解答 */
select class, avg(high) as avgHigh from meibo group by class;

/* 解答 */ select class, avg(high) as avgHigh from meibo group by class;
+-------+----------+
| class | avgHigh  |
+-------+----------+
|  NULL | 160.0000 |
|     1 | 150.0000 |
|     2 | 151.6667 |
|     3 | 157.5000 |
|     7 | 160.0000 |
+-------+----------+
5 rows in set (0.00 sec)

#### <練習問題 2>

上に加えて、クラスごとの人数、一番小さい人と、一番大きな人の身長もそれぞれのクラスで算出しましょう。

In [19]:
/* 解答 */
select class,count(*) as cnt, min(high) as minHigh,max(high) as maxHigh from meibo group by class;

/* 解答 */ select class,count(*) as cnt, min(high) as minHigh,max(high) as maxHigh from meibo group by class;
+-------+-----+---------+---------+
| class | cnt | minHigh | maxHigh |
+-------+-----+---------+---------+
|  NULL |   3 |     160 |     160 |
|     1 |   2 |     150 |     150 |
|     2 |   3 |     150 |     155 |
|     3 |   2 |     155 |     160 |
|     7 |   1 |     160 |     160 |
+-------+-----+---------+---------+
5 rows in set (0.00 sec)

#### <練習問題 3>

年齢が13歳より上の人に絞って、上記と同じ項目を求めてください。

In [20]:
/* 解答 */
select class,count(*) as cnt, min(high) as minHigh,max(high) as maxHigh  from meibo where age > 13 group by class;

/* 解答 */ select class,count(*) as cnt, min(high) as minHigh,max(high) as maxHigh  from meibo where age > 13 group by class;
+-------+-----+---------+---------+
| class | cnt | minHigh | maxHigh |
+-------+-----+---------+---------+
|     1 |   1 |     150 |     150 |
|     2 |   2 |     150 |     155 |
|     7 |   1 |     160 |     160 |
+-------+-----+---------+---------+
3 rows in set (0.00 sec)

### 5.2.5 複数テーブルの利用

#### <練習問題 1>

新しくcardtbというテーブルを作成してください。ただし、カラムはid,point,money (すべてint)にしてください。さらに、以下のデータを挿入してください。<br>(id,point,money) = (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100)

In [21]:
/* 解答 */
create table cardtb
  (id int primary key, point int, money int)
  engine = MyISAM
  default charset = utf8;

/* 解答 */ create table cardtb (id int primary key, point int, money int) engine = MyISAM default charset = utf8;

Query OK, 0 rows affected (0.02 sec)

In [22]:
/* 解答 */
desc cardtb;

/* 解答 */ desc cardtb;
+-------+---------+------+-----+---------+-------+
| Field | Type    | Null | Key | Default | Extra |
+-------+---------+------+-----+---------+-------+
| id    | int(11) | NO   | PRI | NULL    |       |
| point | int(11) | YES  |     | NULL    |       |
| money | int(11) | YES  |     | NULL    |       |
+-------+---------+------+-----+---------+-------+
3 rows in set (0.00 sec)

データの挿入です。

In [23]:
/* 解答 */
insert into cardtb (id,point,money) 
values (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100);

/* 解答 */ insert into cardtb (id,point,money) values (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100);

Query OK, 8 rows affected (0.00 sec)
Records: 8  Duplicates: 0  Warnings: 0

In [24]:
/* 解答 */
select * from cardtb;

/* 解答 */ select * from cardtb;
+----+-------+-------+
| id | point | money |
+----+-------+-------+
|  1 |   100 |  1000 |
|  2 |  NULL |    60 |
|  3 |    50 |   500 |
|  4 |    30 |   600 |
|  5 |    10 |    10 |
|  6 |  NULL |    40 |
|  7 |   100 |  1000 |
|  8 |  2000 |   100 |
+----+-------+-------+
8 rows in set (0.00 sec)

#### <練習問題 2>

meiboテーブルにidをキーとして、上記のテーブルを内部結合させてください。

In [25]:
select * from meibo a join cardtb b on a.id=b.id;

select * from meibo a join cardtb b on a.id=b.id;
+----+----------+-------+------+------+----+-------+-------+
| id | name     | class | age  | high | id | point | money |
+----+----------+-------+------+------+----+-------+-------+
|  1 | Yamada   |     1 |   14 |  150 |  1 |   100 |  1000 |
|  2 | Tanaka   |     2 |   13 |  150 |  2 |  NULL |    60 |
|  3 | Suzuki   |     1 |   13 |  150 |  3 |    50 |   500 |
|  4 | Kato     |     2 |   15 |  150 |  4 |    30 |   600 |
|  5 | Ito      |     3 |   12 |  155 |  5 |    10 |    10 |
|  6 | Takeuchi |     2 |   16 |  155 |  6 |  NULL |    40 |
|  7 | Kimura   |     3 |   11 |  160 |  7 |   100 |  1000 |
|  8 | Sato     |     7 |   14 |  160 |  8 |  2000 |   100 |
+----+----------+-------+------+------+----+-------+-------+
8 rows in set (0.00 sec)

#### <練習問題 3>
meiboテーブルにidをキーとして、上記のテーブルを外部結合させてください。

In [26]:
select * from meibo a left join cardtb b on a.id=b.id;

select * from meibo a left join cardtb b on a.id=b.id;
+-----+--------------+-------+------+------+------+-------+-------+
| id  | name         | class | age  | high | id   | point | money |
+-----+--------------+-------+------+------+------+-------+-------+
|   1 | Yamada       |     1 |   14 |  150 |    1 |   100 |  1000 |
|   2 | Tanaka       |     2 |   13 |  150 |    2 |  NULL |    60 |
|   3 | Suzuki       |     1 |   13 |  150 |    3 |    50 |   500 |
|   4 | Kato         |     2 |   15 |  150 |    4 |    30 |   600 |
|   5 | Ito          |     3 |   12 |  155 |    5 |    10 |    10 |
|   6 | Takeuchi     |     2 |   16 |  155 |    6 |  NULL |    40 |
|   7 | Kimura       |     3 |   11 |  160 |    7 |   100 |  1000 |
|   8 | Sato         |     7 |   14 |  160 |    8 |  2000 |   100 |
| 100 | dummy_Yamada |  NULL | NULL |  160 | NULL |  NULL |  NULL |
| 200 | dummy_Tanaka |  NULL | NULL |  160 | NULL |  NULL |  NULL |
| 300 | dummy_Sato   |  NULL | NULL |  160 | NULL |  NULL |  NULL |
+-----+--------------+-------+------+------+------+-------+-------+
11 rows in set (0.00 sec)

### 5.2.6 case文とサブクエリ

#### <練習問題 1>

meiboテーブルで、highが155未満の場合は"below_155"、155ぴったりならば"equal_155"、155より大きいならば"over_155"と名付けて、テーブルを表示させてください。

In [27]:
/*解答*/
select 
     id
    ,name
    ,case 
        when high <155 then "below_155"
        when high = 155 then "equal_155"
        when high > 155 then "over_155"
        else "others" 
    end as highlevel
from 
    meibo;

/*解答*/ select id ,name ,case when high <155 then "below_155" when high = 155 then "equal_155" when high > 155 then "over_155" else "others" end as highlevel from meibo;
+-----+--------------+-----------+
| id  | name         | highlevel |
+-----+--------------+-----------+
|   1 | Yamada       | below_155 |
|   2 | Tanaka       | below_155 |
|   3 | Suzuki       | below_155 |
|   4 | Kato         | below_155 |
|   5 | Ito          | equal_155 |
|   6 | Takeuchi     | equal_155 |
|   7 | Kimura       | over_155  |
|   8 | Sato         | over_155  |
| 100 | dummy_Yamada | over_155  |
| 200 | dummy_Tanaka | over_155  |
| 300 | dummy_Sato   | over_155  |
+-----+--------------+-----------+
11 rows in set (0.00 sec)

#### <練習問題 2>
上記のテーブルとサブクエリの考え方を利用して、それぞれのhighlevelの人数を求めてください。

In [28]:
/*解答*/
select b.highlevel,count(*) as cnt 
from
(select 
     id
    ,name
    ,case 
        when high <155 then "below_155"
        when high = 155 then "155"
        when high > 155 then "over_155"
        else "others" 
    end as highlevel
from 
    meibo) b
group by highlevel;

/*解答*/ select b.highlevel,count(*) as cnt from (select id ,name ,case when high <155 then "below_155" when high = 155 then "155" when high > 155 then "over_155" else "others" end as highlevel from meibo) b group by highlevel;
+-----------+-----+
| highlevel | cnt |
+-----------+-----+
| 155       |   2 |
| below_155 |   4 |
| over_155  |   5 |
+-----------+-----+
3 rows in set (0.00 sec)

#### <練習問題 3>
上記のテーブルとサブクエリの考え方を利用して、それぞれのhighlevelの平均年齢を求めてください。

In [29]:
/*解答*/
select b.highlevel,avg(age) as avgAge
from
(select 
     id
    ,name
    ,age
    ,case 
        when high <155 then "below_155"
        when high = 155 then "155"
        when high > 155 then "over_155"
        else "others" 
    end as highlevel
from 
    meibo) b
group by highlevel;

/*解答*/ select b.highlevel,avg(age) as avgAge from (select id ,name ,age ,case when high <155 then "below_155" when high = 155 then "155" when high > 155 then "over_155" else "others" end as highlevel from meibo) b group by highlevel;
+-----------+---------+
| highlevel | avgAge  |
+-----------+---------+
| 155       | 14.0000 |
| below_155 | 13.7500 |
| over_155  | 12.5000 |
+-----------+---------+
3 rows in set (0.00 sec)

## 5.3 ビュー

### 5.3.1 ビュー

#### <練習問題 1>
テーブルmeibo2からidとnameを取り出して、ビューのv3を作成してみましょう。

In [30]:
/*解答*/
create view v3
    as
select id,name
    from meibo2;

/*解答*/ create view v3 as select id,name from meibo2;

Query OK, 0 rows affected (0.01 sec)

In [31]:
/*解答*/
select * from v3;

/*解答*/ select * from v3;

Empty set (0.00 sec)

#### <練習問題 2>
meiboテーブルとscoreテーブルを外部結合して、idとnameを取り出すビューv4を作成してみましょう。

In [32]:
/* 解答 */
create view v4
    as
select a.id,a.name from meibo a left join score b on a.id=b.id;

/* 解答 */ create view v4 as select a.id,a.name from meibo a left join score b on a.id=b.id;

Query OK, 0 rows affected (0.01 sec)

In [33]:
/* 解答 */
select * from v4;

/* 解答 */ select * from v4;
+-----+--------------+
| id  | name         |
+-----+--------------+
|   1 | Yamada       |
|   2 | Tanaka       |
|   3 | Suzuki       |
|   4 | Kato         |
|   5 | Ito          |
|   6 | Takeuchi     |
|   7 | Kimura       |
|   8 | Sato         |
| 100 | dummy_Yamada |
| 200 | dummy_Tanaka |
| 300 | dummy_Sato   |
+-----+--------------+
11 rows in set (0.01 sec)

#### <練習問題 3>
上記で作成したテーブルに新しいデータを追加してみましょう。どうなりますか？

In [34]:
/*解答：エラーになります。ビューはいつでも更新できるわけではない。*/
insert into v4 (id, name) values (101, "dummy2_Yamada");
insert into v4 (id, name) values (201, "dummy2_Tanaka");
insert into v4 (id, name) values (301, "dummy2_Sato");

/*解答：エラーになります。ビューはいつでも更新できるわけではない。*/ insert into v4 (id, name) values (101, "dummy2_Yamada"); insert into v4 (id, name) values (201, "dummy2_Tanaka"); insert into v4 (id, name) values (301, "dummy2_Sato");

ERROR 1471 (HY000): The target table v4 of the INSERT is not insertable-into
ERROR 1471 (HY000): The target table v4 of the INSERT is not insertable-into
ERROR 1471 (HY000): The target table v4 of the INSERT is not insertable-into


***

## 5.4 総合問題

### 5.4.1 総合問題1

以下のデータベースを使って、後の問いに答えてください。

https://dev.mysql.com/doc/world-setup/en/

(1) データベースworldを選択して、どのようなテーブルがあるか、またそれぞれどのようなカラムがあるか表示してください。  
(2) それぞれのテーブルについて、それぞれ5行ずつ表示させてください。どんなデータがあるか軽く確認してください。  
(3) cityテーブルについて、レコード数をカウントしてください。また、重複するデータがあるかどうか、チェックしてください。

In [35]:
/*解答　(1)*/
show databases;
use world;

show tables;

desc city;
desc country;
desc countrylanguage;

/*解答　(1)*/ show databases; use world; show tables; desc city; desc country; desc countrylanguage;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| TEST1              |
| employees          |
| foodmart_mondrian  |
| mysql              |
| performance_schema |
| sakila             |
| sys                |
| test2              |
| world              |
+--------------------+
10 rows in set (0.00 sec)

Database changed
+-----------------+
| Tables_in_world |
+-----------------+
| city            |
| country         |
| countrylanguage |
+-----------------+
3 rows in set (0.00 sec)

+-------------+----------+------+-----+---------+----------------+
| Field       | Type     | Null | Key | Default | Extra          |
+-------------+----------+------+-----+---------+----------------+
| ID          | int(11)  | NO   | PRI | NULL    | auto_increment |
| Name        | char(35) | NO   |     |         |                |
| CountryCode | char(3)  | NO   | MUL |         |                |
| District    | char(20) | NO   |     |         |                |
| Population  | int(11)  | NO   |     | 0       |                |
+-------------+----------+------+-----+---------+----------------+
5 rows in set (0.01 sec)

+----------------+---------------------------------------------------------------------------------------+------+-----+---------+-------+
| Field          | Type                                                                                  | Null | Key | Default | Extra |
+----------------+---------------------------------------------------------------------------------------+------+-----+---------+-------+
| Code           | char(3)                                                                               | NO   | PRI |         |       |
| Name           | char(52)                                                                              | NO   |     |         |       |
| Continent      | enum('Asia','Europe','North America','Africa','Oceania','Antarctica','South America') | NO   |     | Asia    |       |
| Region         | char(26)                                                                              | NO   |     |         |       |
| SurfaceArea    | float(10,2)                                                                           | NO   |     | 0.00    |       |
| IndepYear      | smallint(6)                                                                           | YES  |     | NULL    |       |
| Population     | int(11)                                                                               | NO   |     | 0       |       |
| LifeExpectancy | float(3,1)                                                                            | YES  |     | NULL    |       |
| GNP            | float(10,2)                                                                           | YES  |     | NULL    |       |
| GNPOld         | float(10,2)                                                                           | YES  |     | NULL    |       |
| LocalName      | char(45)                                                                              | NO   |     |         |       |
| GovernmentForm | char(45)                                                                              | NO   |     |         |       |
| HeadOfState    | char(60)                                                                              | YES  |     | NULL    |       |
| Capital        | int(11)                                                                               | YES  |     | NULL    |       |
| Code2          | char(2)                                                                               | NO   |     |         |       |
+----------------+---------------------------------------------------------------------------------------+------+-----+---------+-------+
15 rows in set (0.00 sec)

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| CountryCode | char(3)       | NO   | PRI |         |       |
| Language    | char(30)      | NO   | PRI |         |       |
| IsOfficial  | enum('T','F') | NO   |     | F       |       |
| Percentage  | float(4,1)    | NO   |     | 0.0     |       |
+-------------+---------------+------+-----+---------+-------+
4 rows in set (0.00 sec)

In [36]:
/*解答　(2)*/
select * from city limit 5;
select * from country limit 5;
select * from countrylanguage limit 5;

/*解答　(2)*/ select * from city limit 5; select * from country limit 5; select * from countrylanguage limit 5;
+----+----------------+-------------+---------------+------------+
| ID | Name           | CountryCode | District      | Population |
+----+----------------+-------------+---------------+------------+
|  1 | Kabul          | AFG         | Kabol         |    1780000 |
|  2 | Qandahar       | AFG         | Qandahar      |     237500 |
|  3 | Herat          | AFG         | Herat         |     186800 |
|  4 | Mazar-e-Sharif | AFG         | Balkh         |     127800 |
|  5 | Amsterdam      | NLD         | Noord-Holland |     731200 |
+----+----------------+-------------+---------------+------------+
5 rows in set (0.00 sec)

+------+-------------+---------------+---------------------------+-------------+-----------+------------+----------------+---------+---------+-----------------------+----------------------------------------------+--------------------------+---------+-------+
| Code | Name        | Continent     | Region                    | SurfaceArea | IndepYear | Population | LifeExpectancy | GNP     | GNPOld  | LocalName             | GovernmentForm                               | HeadOfState              | Capital | Code2 |
+------+-------------+---------------+---------------------------+-------------+-----------+------------+----------------+---------+---------+-----------------------+----------------------------------------------+--------------------------+---------+-------+
| ABW  | Aruba       | North America | Caribbean                 |      193.00 |      NULL |     103000 |           78.4 |  828.00 |  793.00 | Aruba                 | Nonmetropolitan Territory of The Netherlands | Beatrix                  |     129 | AW    |
| AFG  | Afghanistan | Asia          | Southern and Central Asia |   652090.00 |      1919 |   22720000 |           45.9 | 5976.00 |    NULL | Afganistan/Afqanestan | Islamic Emirate                              | Mohammad Omar            |       1 | AF    |
| AGO  | Angola      | Africa        | Central Africa            |  1246700.00 |      1975 |   12878000 |           38.3 | 6648.00 | 7984.00 | Angola                | Republic                                     | José Eduardo dos Santos  |      56 | AO    |
| AIA  | Anguilla    | North America | Caribbean                 |       96.00 |      NULL |       8000 |           76.1 |   63.20 |    NULL | Anguilla              | Dependent Territory of the UK                | Elisabeth II             |      62 | AI    |
| ALB  | Albania     | Europe        | Southern Europe           |    28748.00 |      1912 |    3401200 |           71.6 | 3205.00 | 2500.00 | Shqipëria             | Republic                                     | Rexhep Mejdani           |      34 | AL    |
+------+-------------+---------------+---------------------------+-------------+-----------+------------+----------------+---------+---------+-----------------------+----------------------------------------------+--------------------------+---------+-------+
5 rows in set (0.00 sec)

+-------------+------------+------------+------------+
| CountryCode | Language   | IsOfficial | Percentage |
+-------------+------------+------------+------------+
| ABW         | Dutch      | T          |        5.3 |
| ABW         | English    | F          |        9.5 |
| ABW         | Papiamento | F          |       76.7 |
| ABW         | Spanish    | F          |        7.4 |
| AFG         | Balochi    | F          |        0.9 |
+-------------+------------+------------+------------+
5 rows in set (0.00 sec)

In [37]:
/*解答　(3)*/
/*重複はなし*/
select count(*) as all_record, count(distinct ID) as distinct_ID from city;

/*解答　(3)*/ /*重複はなし*/ select count(*) as all_record, count(distinct ID) as distinct_ID from city;
+------------+-------------+
| all_record | distinct_ID |
+------------+-------------+
|       4079 |        4079 |
+------------+-------------+
1 row in set (0.01 sec)

### 5.4.2 総合問題2
上記と同じデータベースを使って、以下の問いに答えてください。

(1) countrylanguageテーブルについて、それぞれのCountryCodeを軸に、言語の数（テーブルにあるものだけ、重複なく）を計算してください。また、その結果をcityテーブルに紐付けて（joinして）、cityのカラム全てとその言語の数を表示してください。ただし、結果は5行のみ表示させるだけでよいです。  
(2)  countrylanguageテーブルについて、それぞれのCountryCodeを軸に、Percentageを合計してください。ただし、その合計値が99.9を超えるものだけ表示させるようにしてください。  
(3)  cityテーブルについて、DistrictのイニシャルがAではじまるもの、Bではじまるもの、Cではじまるもの、その他(others)の4パターンに分けて、それぞれのレコード数をカウントしてください。

In [38]:
/*解答(1)*/
select a.*,b.lang_cnt from city a left outer join 
(select CountryCode,count(distinct Language) as lang_cnt from countrylanguage group by 1) b
on a.CountryCode = b.CountryCode limit 5;

/*解答(1)*/ select a.*,b.lang_cnt from city a left outer join (select CountryCode,count(distinct Language) as lang_cnt from countrylanguage group by 1) b on a.CountryCode = b.CountryCode limit 5;
+----+----------------+-------------+---------------+------------+----------+
| ID | Name           | CountryCode | District      | Population | lang_cnt |
+----+----------------+-------------+---------------+------------+----------+
|  1 | Kabul          | AFG         | Kabol         |    1780000 |        5 |
|  2 | Qandahar       | AFG         | Qandahar      |     237500 |        5 |
|  3 | Herat          | AFG         | Herat         |     186800 |        5 |
|  4 | Mazar-e-Sharif | AFG         | Balkh         |     127800 |        5 |
|  5 | Amsterdam      | NLD         | Noord-Holland |     731200 |        4 |
+----+----------------+-------------+---------------+------------+----------+
5 rows in set (0.01 sec)

In [39]:
/*解答(2)*/
select CountryCode, sum(Percentage) all_P from countrylanguage group by 1 having all_P>99.9 limit 5;

/*解答(2)*/ select CountryCode, sum(Percentage) all_P from countrylanguage group by 1 having all_P>99.9 limit 5;
+-------------+-------+
| CountryCode | all_P |
+-------------+-------+
| BHS         | 100.0 |
| BMU         | 100.0 |
| BTN         | 100.0 |
| CHL         | 100.0 |
| CPV         | 100.0 |
+-------------+-------+
5 rows in set (0.00 sec)

In [40]:
/*解答(3)*/
select 
    case
        when District like 'A%' then "FromA"
        when District like 'B%' then "FromB"
        when District like 'C%' then "FromC"
        else "others" 
    end as initial_District,
    count(*) as cnt
from 
    city
    group by 1;

/*解答(3)*/ select case when District like 'A%' then "FromA" when District like 'B%' then "FromB" when District like 'C%' then "FromC" else "others" end as initial_District, count(*) as cnt from city group by 1;
+------------------+------+
| initial_District | cnt  |
+------------------+------+
| FromA            |  273 |
| FromB            |  217 |
| FromC            |  326 |
| others           | 3263 |
+------------------+------+
4 rows in set (0.01 sec)